Tekla Open API Reference for Tekla Structures 2025
FontAttributes Properties
The FontAttributes type exposes the following members.
Properties
Name | Description
Bold
 Whether the font is bold.
Color
 The color of the font.
Height
 The height of the font (in millimeters).
Italic
 Whether the font is italic.
Name
 The name of the font.
TrueColor
 The true color (rgb enabled) of the font.
Top
See Also
Reference
FontAttributes Class
Tekla.Structures.Drawing Namespace